In [10]:
# Importing the Numpy
import numpy as np

# Exercise 1:
Create a numpy array containing the numbers from 1 to 10, and then reshape it to a 2x5 matrix.

In [9]:
# Creating a numpy array from 1 to 10
a = np.arange(1, 11)
a
# Reshaping it into a 2x5 matrix
reshaped_a = a.reshape(2, 5)

print(reshaped_a)
print('Dimension of res-abc:', reshaped_a.ndim)
print('Shape of res_abc:', reshaped_a.shape)

[[ 1  2  3  4  5]
 [ 6  7  8  9 10]]
Dimension of res-abc: 2
Shape of res_abc: (2, 5)

# Exercise 2:
Create a numpy array containing the numbers from 1 to 20, and then extract the elements between the 5th and 15th index.

In [20]:
# Creating a numpy array from 1 to 20
b = np.arange(1, 21)

# Extracting elements from index 5 to 15
extracted = b[5:16]
print('The numpy array from 1 to 20: ',b)
print('The extracted element from the numpy array from the index 5 to 15: ',extracted)

The numpy array from 1 to 20:  [ 1  2  3  4  5  6  7  8  9 10 11 12 13 14 15 16 17 18 19 20]
The extracted element from the numpy array from the index 5 to 15:  [ 6  7  8  9 10 11 12 13 14 15 16]

# Exercise 3:
Create a Pandas series with the following data: {'apples': 3, 'bananas': 2, 'oranges': 1}. Then, add a new item to the series with the key 'pears' and the value 4.

In [21]:
# Importing the pandas
import pandas as pd

In [37]:
# Creating the initial Pandas series
fruits = pd.Series({'apples': 3, 'bananas': 2, 'oranges': 1})
# Adding a new item 'pears' with value 4
fruits['pears'] = 4
print('The list of fruits are:\n', fruits)

The list of fruits are:
 apples     3
bananas    2
oranges    1
pears      4
dtype: int64

# Exercise 4:
Create a dataframe with the following columns: name, age, and gender. The dataframe should have 10 rows of data.

In [32]:
# Creating a dataframe with name, age, and gender columns
a = {
    'name': ['Ram', 'Seeta', 'Rahman', 'Joseph', 'Messi', 'Anna', 'Tony', 'Latheef', 'James', 'Empuran'],
    'age': [20, 18, 23, 44, 34, 55, 12, 45, 40, 40],
    'gender': ['Male', 'Female', 'Male', 'Male', 'Male', 'Female', 'Male', 'Male', 'Male', 'Other']
}

Data = pd.DataFrame(a)

print('The output is:\n', Data)

The output is:
       name  age  gender
0      Ram   20    Male
1    Seeta   18  Female
2   Rahman   23    Male
3   Joseph   44    Male
4    Messi   34    Male
5     Anna   55  Female
6     Tony   12    Male
7  Latheef   45    Male
8    James   40    Male
9  Empuran   40   Other

# Exercise 5:
Add a new column to the data frame created in question 1, called occupation. The values for this column should be Programmer, Manager, and Analyst, corresponding to the rows in the dataframe.

In [31]:
# Add a new 'occupation' column
Data['occupation'] = ['Programmer', 'Manager', 'Analyst', 'Programmer', 'Manager',
                     'Analyst', 'Programmer', 'Manager', 'Analyst', 'Programmer']

print('The Output is:\n',Data)

The Output is:
       name  age  gender  occupation
0      Ram   20    Male  Programmer
1    Seeta   18  Female     Manager
2   Rahman   23    Male     Analyst
3   Joseph   44    Male  Programmer
4    Messi   34    Male     Manager
5     Anna   55  Female     Analyst
6     Tony   12    Male  Programmer
7  Latheef   45    Male     Manager
8    James   40    Male     Analyst
9  Empuran   40   Other  Programmer

# Exercise 6:
Select the rows of the dataframe where the age is greater than or equal to 30.

In [38]:
# Filtering rows where the age is >= 30
Data_age_30 = Data[Data['age'] >= 30]

print(Data_age_30)

      name  age  gender
3   Joseph   44    Male
4    Messi   34    Male
5     Anna   55  Female
7  Latheef   45    Male
8    James   40    Male
9  Empuran   40   Other

# Exercise 7:
Convert this dataframe to a csv file and read that csv file, finally display the contents.

In [39]:
# Converting the dataframe to a CSV file
Data.to_csv('data.csv', index=False)

# Reading the CSV file
Data_from_csv = pd.read_csv('data.csv')

# Displaying the contents
print('The Data from the .csv file is:\n', Data_from_csv)

The Data from the .csv file is:
       name  age  gender
0      Ram   20    Male
1    Seeta   18  Female
2   Rahman   23    Male
3   Joseph   44    Male
4    Messi   34    Male
5     Anna   55  Female
6     Tony   12    Male
7  Latheef   45    Male
8    James   40    Male
9  Empuran   40   Other